inst/doc-equivalence/equivalence.tex
\section{Illustrative datasets}
\label{sec:org9bf6ee7}

We will consider two illustrative datasets:
\begin{itemize}
\item data from the abeta study lifestyle and psychosicial data between
patients with newly diagnosed bipolar disorder (\texttt{BD}) and matched
healthy controls (\texttt{HC}) at baseline: functioning assessment test
(\texttt{fast0}), quality of life (\texttt{qol0}), perceived stress score
(\texttt{pss0}), \ldots{} and at 1 year follow-up (\texttt{pss1}, \texttt{fast1}, \texttt{qol1}, for
\texttt{BD} only).
\end{itemize}
\begin{lstlisting}[language=r,numbers=none]
data(abetaW, package = "LMMstar")
abetaW$missingreason <- NULL
head(abetaW)
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}
  id sex age group episode fast0 qol0 pss0 fast1 pss1 qol1 educationyears alcohol
1  1   M  30    BD       0     1   88    9     0   NA   NA             13       0
2  2   F  55    BD       1    32   87   21    NA   NA   NA             15       0
3  3   M  51    BD       0    29   86   23    31   27   79             21       1
4  4   M  38    BD       0     1   96    7     6    6  101             21       1
5  5   M  21    BD       0     3   97    1     1    5  105             12       1
6  6   M  42    BD       1    22   70   17    40   18   68             13       0
\end{verbatim}


This dataset shows great difference in heterogeneity between the two groups, e.g.:
\begin{lstlisting}[language=r,numbers=none]
library(LMMstar)
summarize(pss0 ~ group, data = abetaW, na.rm = TRUE)
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}
  group observed missing    mean     sd min   q1 median    q3 max
1    BD       86       1 13.2674 6.8435   1 7.25     13 17.75  29
2    HC       44       0  7.2727 5.0272   0 3.75      6 10.50  19
\end{verbatim}


We will also use a balanced version of this dataset (equal group size):
\begin{lstlisting}[language=r,numbers=none]
abetaW.B <- do.call(rbind, by(abetaW, abetaW$group, function(iDF){
  iDF[which(!is.na(iDF$pss0))[1:44],]
}))
\end{lstlisting}

\clearpage

\begin{itemize}
\item data from the calcium dataset, a two-arm randomized clinical trial
comparing bone mineral density between calcium supplement (\texttt{C}) and
placebo (\texttt{P}). Visits were planned every 6 months, \texttt{bmd1} refers to
the baseline measurement and \texttt{bmd2}, \ldots, \texttt{bmd5} refers to
post-intervention measurements. \texttt{time.obs1},\ldots, \texttt{time.obs5}
refer to the time elpased from baseline measurement in years.
\end{itemize}

\begin{lstlisting}[language=r,numbers=none]
data(calciumL, package = "LMMstar")
calciumL <- merge(by = "girl", calciumL,
                  transform(calciumL, baseline = bmd)[calciumL$visit==1,c("girl","baseline")])
calciumL <- calciumL[order(calciumL$girl,calciumL$visit),]
head(calciumL)
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}
   girl grp dropout dropvisit visit time.obs bmd baseline
1   101   C       0        NA     1  0.00000 815      815
3   101   C       0        NA     2  0.51472 875      815
5   101   C       0        NA     3  0.98015 911      815
2   101   C       0        NA     4  1.49760 952      815
4   101   C       0        NA     5  1.99589 970      815
10  102   P       0        NA     1  0.00000 813      813
\end{verbatim}



The corresponding wide format is
\begin{lstlisting}[language=r,numbers=none]
data(calciumW, package = "LMMstar")
calciumW$dropout <- NULL
calciumW$dropvisit <- NULL
head(calciumW)
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}
  girl grp bmd1 bmd2 bmd3 bmd4 bmd5 time.obs1 time.obs2 time.obs3 time.obs4 time.obs5
1  101   C  815  875  911  952  970         0   0.51472   0.98015    1.4976    1.9959
2  102   P  813  833  855  881  901         0   0.51472   0.95551    1.4730    1.9521
3  103   P  812  812  843  855  895         0   0.51198   0.95825    1.4757    1.9548
4  104   C  804  847  885  920  948         0   0.51198   0.97194    1.5086    2.1136
5  105   C  904  927  952  955 1002         0   0.57495   0.97741    1.4757    1.9548
6  106   P  831  855  890  908  933         0   0.53388   1.01300    1.5907    2.1684
\end{verbatim}


We will use the placebo group as reference:
\begin{lstlisting}[language=r,numbers=none]
calciumW$grp <- relevel(calciumW$grp, "P")
calciumL$grp <- relevel(calciumL$grp, "P")
\end{lstlisting}

and the change from baseline in bone mineral density:
\begin{lstlisting}[language=r,numbers=none]
calciumW$change2 <- calciumW$bmd2 - calciumW$bmd1
calciumW$change3 <- calciumW$bmd3 - calciumW$bmd1
calciumW$change4 <- calciumW$bmd4 - calciumW$bmd1
calciumW$change5 <- calciumW$bmd5 - calciumW$bmd1
calciumL$change <- calciumL$bmd - calciumL$baseline
\end{lstlisting}


For illustrative purpose, we will restrict both dataset to subjects
with complete data:
\begin{lstlisting}[language=r,numbers=none]
calciumW.NNA <- calciumW[rowSums(is.na(calciumW))==0,]
calciumL.NNA <- calciumL[calciumL$girl %in% calciumW.NNA$girl,]
\end{lstlisting}

as the aim is to show equivalence between statistical tests when there
is no missing data. 

\clearpage
\section{Equivalence with other statistical methods}
\label{sec:org1fe2417}
\subsection{Welch two sample t-test}
\label{sec:org4e741e4}

A two sample t-test:
\begin{lstlisting}[language=r,numbers=none]
with(abetaW, t.test(x = pss0[group=="BD"], y = pss0[group=="HC"]))
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}

	Welch Two Sample t-test

data:  pss0[group == "BD"] and pss0[group == "HC"]
t = 5.67, df = 112, p-value = 1.1e-07
alternative hypothesis: true difference in means is not equal to 0
95 percent confidence interval:
 3.8988 8.0906
sample estimates:
mean of x mean of y 
  13.2674    7.2727
\end{verbatim}

is equivalent to a linear regression with a group-specific residual
variance:
\begin{lstlisting}[language=r,numbers=none]
abetaW$group <- relevel(abetaW$group,"HC")
e.ttest <- lmm(pss0 ~ group, structure = IND(~group), 
               data = abetaW, trace = FALSE)
model.tables(e.ttest, effects = "all")
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}
            estimate      se      df  lower  upper    p.value
(Intercept)   7.2727 0.75788  43.009 5.7443 8.8011 2.9650e-12
groupBD       5.9947 1.05781 112.201 3.8988 8.0906 1.1399e-07
sigma         5.0272 0.54210  43.009 4.0447 6.2484         NA
k.BD          1.3613 0.18014  86.351 1.0464 1.7709 2.2090e-02
\end{verbatim}


\noindent For comparison a linear model would estimate different standard
errors, degrees of freedom, and p-values:
\begin{lstlisting}[language=r,numbers=none]
model.tables(lmm(pss0 ~ group, data = abetaW))
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}
            estimate      se     df  lower  upper    p.value
(Intercept)   7.2727 0.94857 128.03 5.3958 9.1496 3.8629e-12
groupBD       5.9947 1.16625 128.03 3.6871 8.3023 1.0000e-06
\end{verbatim}


as it does not account for heteroschedasticity. This makes the
'heteroschedastic linear regression' \texttt{e.ttest} a natural extension of
the t-test when it comes to account for covariates.

\clearpage

In the special case of two groups of equal size, the standard errors
will be estimated the same:
\begin{lstlisting}[language=r,numbers=none]
model.tables(lmm(pss0 ~ group, structure = IND(~group), 
                 data = abetaW.B, trace = FALSE))
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}
            estimate      se     df   lower   upper    p.value
(Intercept)  11.8636 0.98648 43.009  9.8742 13.8530 2.4425e-15
groupHC      -4.5909 1.24399 80.661 -7.0662 -2.1156 4.0523e-04
\end{verbatim}


\begin{lstlisting}[language=r,numbers=none]
model.tables(lmm(pss0 ~ group, data = abetaW.B))
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}
            estimate      se     df   lower   upper    p.value
(Intercept)  11.8636 0.87964 86.017 10.1150 13.6123 0.00000000
groupHC      -4.5909 1.24399 86.017 -7.0639 -2.1179 0.00039184
\end{verbatim}


leading to very similar p-values (degrees of freedom differ slightly).

\clearpage
