inst/doc-equivalence/equivalence.org
** Paired t-test

With complete data, a paired t-test:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
t.test(calciumW.NNA$bmd2, calciumW.NNA$bmd1, paired = TRUE)
#+END_SRC

#+RESULTS:
#+begin_example

	Paired t-test

data:  calciumW.NNA$bmd2 and calciumW.NNA$bmd1
t = 13, df = 90, p-value <2e-16
alternative hypothesis: true mean difference is not equal to 0
95 percent confidence interval:
 20.229 27.529
sample estimates:
mean difference 
         23.879
#+end_example

is equivalent to a LMM with an unstructured covariate pattern:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
e.lmm2tt <- lmm(bmd ~ visit, repetition = ~visit|girl, structure = "UN",
                data = calciumL.NNA)
model.tables(e.lmm2tt)["visit2",,drop=FALSE]
#+END_SRC

#+RESULTS:
:        estimate     se     df  lower  upper p.value
: visit2   23.879 1.8371 89.968 20.229 27.529       0

\clearpage

** Comparing change
*** Using a Welch two sample t-test

With complete data, a two sample t-test comparing the change from baseline:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
ttc <- with(calciumW.NNA, t.test(x = change2[grp=="C"], y = change2[grp=="P"]))
ttc
#+END_SRC

#+RESULTS:
#+begin_example

	Welch Two Sample t-test

data:  change2[grp == "C"] and change2[grp == "P"]
t = 2.03, df = 88.8, p-value = 0.046
alternative hypothesis: true difference in means is not equal to 0
95 percent confidence interval:
  0.14074 14.49659
sample estimates:
mean of x mean of y 
   27.659    20.340
#+end_example

is equivalent to a LMM with a stratified unstructured covariate pattern:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
e.lmm2tt2 <- lmm(bmd ~ visit*grp, repetition = ~visit|girl, structure = UN(~grp),
                 data = calciumL.NNA)
model.tables(e.lmm2tt2)[c("visit2","visit2:grpC"),,drop=FALSE]
#+END_SRC

#+RESULTS:
:             estimate     se     df    lower  upper    p.value
: visit2       20.3404 2.5338 46.005 15.24013 25.441 2.6911e-10
: visit2:grpC   7.3187 3.6124 88.734  0.14069 14.497 4.5767e-02

The estimate and standard error are exactly the same:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
c(ttc$estimate["mean of x"] - ttc$estimate["mean of y"],
  se = ttc$stderr)
#+END_SRC

#+RESULTS:
: mean of x        se 
:    7.3187    3.6124

The only (small) difference lies in the estimation of the degrees of freedom.

\clearpage

*** Using a linear regression

Using a linear model to compare change over time:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
eLM.change <- lm(change2 ~ grp, data = calciumW.NNA)
summary(eLM.change)$coef
#+END_SRC

#+RESULTS:
:             Estimate Std. Error t value   Pr(>|t|)
: (Intercept)  20.3404     2.5133  8.0931 2.7975e-12
: grpC          7.3187     3.6144  2.0249 4.5878e-02

is equivalent to the following mixed model:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
eLMM.change <- lmm(bmd ~ visit*grp,
                   repetition =~ visit|girl, structure = UN,
                   data = calciumL.NNA)
model.tables(eLMM.change)[c("visit2","visit2:grpC"),]
#+END_SRC

#+RESULTS:
:             estimate     se     df    lower  upper    p.value
: visit2       20.3404 2.5133 88.962 15.34654 25.334 2.8044e-12
: visit2:grpC   7.3187 3.6144 88.962  0.13688 14.500 4.5880e-02

Here, since the linear regression assumes the same variance in both
groups, we did not stratified the covariance pattern on group. The
same equivalence would hold with a continuous exposure (say dose)
instead of a binary exposure (here =grp=).

\bigskip

In presence of a covariate:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
calciumW2.NNA <- cbind(calciumW.NNA,
                       age = round(runif(NROW(calciumW.NNA), min = 18, max = 60)))
calciumL2.NNA <- merge(calciumL.NNA, calciumW2.NNA[,c("girl","age")], by = "girl")

eLMadj.change <- lm(change2 ~ grp + age, data = calciumW2.NNA)
summary(eLMadj.change)$coef
#+END_SRC

#+RESULTS:
:              Estimate Std. Error  t value  Pr(>|t|)
: (Intercept) 21.665002    6.66811  3.24905 0.0016405
: grpC         7.340294    3.63533  2.01916 0.0465143
: age         -0.033579    0.15643 -0.21465 0.8305347

one should specify interaction with time in the mixed model to
retrieve the same results:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
eLMMadj.change <- lmm(bmd ~ visit*grp + visit*age,
                      repetition =~ visit|girl, structure = UN,
                      data = calciumL2.NNA)
model.tables(eLMMadj.change)[c("visit2","visit2:grpC"),]
#+END_SRC

#+RESULTS:
:             estimate     se     df  lower  upper   p.value
: visit2       21.6650 6.6681 87.963 8.4135 34.917 0.0016408
: visit2:grpC   7.3403 3.6353 87.963 0.1158 14.565 0.0465156


\clearpage

