inst/doc-equivalence/equivalence.org
** Person's correlation

One can retrieve Pearson's correlation:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
cor.test(calciumW.NNA$bmd1,calciumW.NNA$bmd5)
#+END_SRC

#+RESULTS:
#+begin_example

	Pearson's product-moment correlation

data:  calciumW.NNA$bmd1 and calciumW.NNA$bmd5
t = 18.3, df = 89, p-value <2e-16
alternative hypothesis: true correlation is not equal to 0
95 percent confidence interval:
 0.83615 0.92551
sample estimates:
    cor 
0.88901
#+end_example

using a linear mixed model moving to the long format and using an
unstructured mean and covariance pattern over time:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
eCor.lmm <- lmm(bmd ~ visit, repetition = ~visit|girl,
                structure = UN, data = calciumL.NNA)
model.tables(eCor.lmm,  effects = "correlation")["rho(1,5)",]
#+END_SRC

#+RESULTS:
:          estimate     se     df   lower   upper p.value
: rho(1,5)  0.88901 0.0221 96.839 0.83607 0.92555       0

P-value and confidence interval will differ (only slightly in large
samples) because =cor.test= uses an exact[fn::assuming jointly
normally distributed outcomes] formula for the variance after =atanh=
transformation while the linear mixed model rely on the observed
information matrix. In this example the observed information (default
option) is more in line with =cor.test= than the expected information:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
model.tables(eCor.lmm,  type.information = "expected", effects = "correlation")["rho(1,5)",]
#+END_SRC

#+RESULTS:
:          estimate       se       df   lower   upper p.value
: rho(1,5)  0.88901 0.021914 17285033 0.83738 0.92492       0

Of note the confidence intervals and p-value of =cor.test= are not
computed in a consistent way: 
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
set.seed(7303)
X <- rnorm(10)
Y <- rnorm(10)
cor.test(X,Y)
#+END_SRC

#+RESULTS:
#+begin_example

	Pearson's product-moment correlation

data:  X and Y
t = 2.29, df = 8, p-value = 0.051
alternative hypothesis: true correlation is not equal to 0
95 percent confidence interval:
 0.00016154 0.90179629
sample estimates:
    cor 
0.62972
#+end_example

\noindent Here the confidence intervals do not overlap 0, i.e.,
suggest to reject the null hypothesis while the p-value is greater
than 0.05, i.e., does not suggest to reject the null hypothesis. The
corresponding mixed model estimate:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
dfXY <- rbind(data.frame(value = X, variable = "x", id = 1:10),
              data.frame(value = Y, variable = "y", id = 1:10))
e.lmmXY <- lmm(value ~ variable, repetition = ~variable|id,
               structure = UN, data = dfXY)
model.tables(e.lmmXY, effects = "correlation")
#+END_SRC

#+RESULTS:
:          estimate      se     df     lower   upper  p.value
: rho(x,y)  0.62972 0.20115 7.0024 -0.047159 0.91027 0.061602

is the same but the confidence intervals and p-value differ more
substantially (due to small sample approximations). They however are
consistent with respect to whether to reject the null hypothesis.

\clearpage

** Comparing Person's correlation

To compare the Pearson's correlation between two groups,
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
library(cocor)
cocor.indep.groups(r1.jk = with(calciumW.NNA, cor(bmd1[grp=="C"],bmd5[grp=="C"])),
                   n1 = sum(calciumW$grp=="C"),
                   r2.hm = with(calciumW.NNA, cor(bmd1[grp=="P"],bmd5[grp=="P"])),
                   n2 = sum(calciumW$grp=="P"))
#+END_SRC

#+RESULTS:
#+begin_example

  Results of a comparison of two correlations based on independent groups

Comparison between r1.jk = 0.8597 and r2.hm = 0.917
Difference: r1.jk - r2.hm = -0.0574
Group sizes: n1 = 55, n2 = 57
Null hypothesis: r1.jk is equal to r2.hm
Alternative hypothesis: r1.jk is not equal to r2.hm (two-sided)
Alpha: 0.05

fisher1925: Fisher's z (1925)
  z = -1.4304, p-value = 0.1526
  Null hypothesis retained

zou2007: Zou's (2007) confidence interval
  95% confidence interval for r1.jk - r2.hm: -0.1531 0.0210
  Null hypothesis retained (Interval includes 0)
#+end_example


#+BEGIN_SRC R :exports both :results output :session *R* :cache no
eCor2.lmm <- lmm(bmd ~ visit*grp, repetition = ~visit|girl,
                structure = UN(~grp), data = calciumL.NNA)
model.tables(eCor2.lmm,  effects = "correlation")[c("rho(1,5):C","rho(1,5):P"),]
#+END_SRC

#+RESULTS:
:            estimate       se     df   lower   upper    p.value
: rho(1,5):C  0.85965 0.039801 42.111 0.75492 0.92163 1.2128e-10
: rho(1,5):P  0.91701 0.023456 53.835 0.85496 0.95319 7.3275e-15

#+BEGIN_SRC R :exports both :results output :session *R* :cache no
summary(anova(eCor2.lmm, effects = "rho(1,5):C - rho(1,5):P = 0", transform.rho = "none"))
#+END_SRC

#+RESULTS:
#+begin_example
		Multivariate Wald test 

       statistic      df p.value  
   all     1.542 (1,3.7)   0.288  
   ------------------------------ 
    :  0 '***' 0.001 '**' 0.01 '*' 0.05 '.' 0.1 ' ' 1.
  df: Satterthwaite approximation w.r.t. model-based se. 

		Univariate Wald test 

                               estimate    se  df lower upper p.value  
   rho(1,5):C - rho(1,5):P = 0   -0.057 0.046 3.7 -0.19 0.076   0.288  
   ------------------------------------------------------------------- 
    :  0 '***' 0.001 '**' 0.01 '*' 0.05 '.' 0.1 ' ' 1.
  df: Satterthwaite approximation w.r.t. model-based se. 
  se: Modeled based on the observed information.
#+end_example


#+BEGIN_SRC R :exports both :results output :session *R* :cache no
summary(anova(eCor2.lmm, effects = "rho(1,5):C - rho(1,5):P = 0", transform.rho = "atanh"))
Theta <- coef(eCor2.lmm, effects = "correlation", transform.rho = "atanh")[c("atanh(rho)(1,5):P","atanh(rho)(1,5):C")]
Sigma <- vcov(eCor2.lmm, effects = "correlation", transform.rho = "atanh")[c("atanh(rho)(1,5):P","atanh(rho)(1,5):C"),
                                                                           c("atanh(rho)(1,5):P","atanh(rho)(1,5):C")]
Theta/sqrt(diag(Sigma))


#+END_SRC

#+RESULTS:
#+begin_example
		Multivariate Wald test 

       statistic       df p.value  
   all     1.717 (1,93.6)   0.193  
   ------------------------------- 
    :  0 '***' 0.001 '**' 0.01 '*' 0.05 '.' 0.1 ' ' 1.
  df: Satterthwaite approximation w.r.t. model-based se. 

		Univariate Wald test 

                               estimate    se   df  lower upper p.value  
   rho(1,5):C - rho(1,5):P = 0   -0.057 0.212 93.6 -0.479 0.364   0.787  
   --------------------------------------------------------------------- 
    :  0 '***' 0.001 '**' 0.01 '*' 0.05 '.' 0.1 ' ' 1.
  df: Satterthwaite approximation w.r.t. model-based se. 
  se: Modeled based on the observed information.
atanh(rho)(1,5):P atanh(rho)(1,5):C 
          10.6478            8.4723
atanh(rho)(1,5):C 
          0.19348
#+end_example

#+BEGIN_SRC R :exports both :results output :session *R* :cache no
2*(1-pt(abs(diff(Theta)/sqrt(sum(diag(Sigma)) - 2*Sigma[1,2])), df = 90))
#+END_SRC

