inst/doc-equivalence/equivalence.tex
\subsection{Correlation between changes}
\label{sec:org0ba4a31}

In some studies, one is interested in studying the relation between
two evolutions. Say weight and glucagon before and after the
operation:
\begin{lstlisting}[language=r,numbers=none]
gastricbypassW$changeG41 <- gastricbypassW$glucagonAUC4-gastricbypassW$glucagonAUC1
gastricbypassW$changeW41 <- gastricbypassW$weight4-gastricbypassW$weight1
\end{lstlisting}

\bigskip

One can evaluate their correlation:
\begin{lstlisting}[language=r,numbers=none]
cor.test(gastricbypassW$changeW41, gastricbypassW$changeG41)
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}

	Pearson's product-moment correlation

data:  gastricbypassW$changeW41 and gastricbypassW$changeG41
t = 1.89, df = 18, p-value = 0.075
alternative hypothesis: true correlation is not equal to 0
95 percent confidence interval:
 -0.043829  0.719624
sample estimates:
    cor 
0.40658
\end{verbatim}

or regress one against the other:
\begin{lstlisting}[language=r,numbers=none]
e2.change41 <- lm(changeG41 ~ changeW41, data = gastricbypassW)
summary(e2.change41)$coef
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}
            Estimate Std. Error t value Pr(>|t|)
(Intercept)  65.0794   24.83368  2.6206 0.017331
changeW41     1.7082    0.90473  1.8881 0.075246
\end{verbatim}


This problem can be recast using all measurement as outcomes:
\begin{lstlisting}[language=r,numbers=none]
keep.col <- c("id","weight1","weight4","glucagonAUC1","glucagonAUC4")
gastricbypassL4 <- reshape(gastricbypassW[,keep.col], direction = "long",
                           idvar = "id", varying = 2:5, timevar = "type", v.names = "value")
gastricbypassL4$type <- factor(gastricbypassL4$type, labels = keep.col[-1])
gastricbypassL4 <- gastricbypassL4[order(gastricbypassL4$id),]
head(gastricbypassL4)
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}
    id         type   value
1.1  1      weight1 127.200
1.2  1      weight4 108.100
1.3  1 glucagonAUC1  20.690
1.4  1 glucagonAUC4  43.434
2.1  2      weight1 165.200
2.2  2      weight4 132.000
\end{verbatim}


fitting an unstructured mixed model:
\begin{lstlisting}[language=r,numbers=none]
e.lmm4 <- lmm(value ~ type,
              repetition = ~type|id, structure = "UN",
              data = gastricbypassL4)
\end{lstlisting}

extract the residual covariance matrix:
\begin{lstlisting}[language=r,numbers=none]
sigma.lmm4 <- sigma(e.lmm4)
sigma.lmm4
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}
               weight1 weight4 glucagonAUC1 glucagonAUC4
weight1       410.8475  326.84       1.7077     -217.399
weight4       326.8357  290.84     -24.6003     -161.696
glucagonAUC1    1.7077  -24.60     241.7007      -81.649
glucagonAUC4 -217.3994 -161.70     -81.6493      442.464
\end{verbatim}


Deduce the residual covariance matrix for the change:
\begin{lstlisting}[language=r,numbers=none]
Mcon <- cbind(c(-1,1,0,0),c(0,0,-1,1))
sigmeChange.lmm4 <- t(Mcon) %*% sigma.lmm4 %*% Mcon
dimnames(sigmeChange.lmm4) <- list(c("d.weight","d.glucagonAUC"),
                                   c("d.weight","d.glucagonAUC"))
sigmeChange.lmm4
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}
              d.weight d.glucagonAUC
d.weight        48.011        82.011
d.glucagonAUC   82.011       847.464
\end{verbatim}


and the corrrelation or covariance:
\begin{lstlisting}[language=r,numbers=none]
cov2cor(sigmeChange.lmm4)[1,2]
sigmeChange.lmm4[1,2]/sigmeChange.lmm4[1,1]
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}
[1] 0.40658
[1] 1.7082
\end{verbatim}


The uncertainty can be quantified using a delta method:
\begin{lstlisting}[language=r,numbers=none]
estimate(e.lmm4, function(p){
  Sigma.change <- t(Mcon) %*% sigma(e.lmm4, p = p) %*% Mcon
  c(cor = cov2cor(Sigma.change)[1,2],
    beta = Sigma.change[1,2]/Sigma.change[1,1])
})
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}
     estimate      se     df    lower  upper p.value
cor   0.40658 0.19150 2.5925 -0.26078 1.0739 0.13791
beta  1.70818 0.88073 2.6876 -1.28836 4.7047 0.15837
\end{verbatim}


The standard errors and degrees of freedom do not match the univariate
analysis, suggesting poor small sample properties of this
technic.

\clearpage
\section{Equivalence with other R packages}
\label{sec:org4c39a04}

\subsection{nlme package}
\label{sec:orgd092264}

The model class obtained with the \texttt{lmm} function overlaps the model
class of the \texttt{lme} and \texttt{gls} functions from the nlme package.
\begin{lstlisting}[language=r,numbers=none]
library(nlme)
\end{lstlisting}

For instance, the compound symmetry is equivalent to \texttt{corCompSymm}
correlation structure, or to a random intercept model (when the within
subject correlation is positive):
\begin{lstlisting}[language=r,numbers=none]
eRI.lmm <- lmm(weight ~ visit*group, structure = "RE",
               data = gastricbypassL, repetition = ~visit|id)
eCS.gls <- gls(weight ~ visit*group, correlation = corCompSymm(form=~visit|id),
               data = gastricbypassL, na.action = na.omit)
eCS.lme <- lme(weight ~ visit*group, random = ~1|id,
               data = gastricbypassL, na.action = na.omit)
logLik(eRI.lmm)
logLik(eCS.lme)
logLik(eCS.gls)
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}
[1] -236.21
'log Lik.' -236.21 (df=10)
'log Lik.' -236.21 (df=10)
\end{verbatim}


The estimated random effect also match:
\begin{lstlisting}[language=r,numbers=none]
range(ranef(eRI.lmm)-ranef(eCS.lme))
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}
[1] -1.7303e-08  2.6979e-08
\end{verbatim}


Unstructured residual covariance matrix can also be obtained with
\texttt{gls}:
\begin{lstlisting}[language=r,numbers=none]
eUN.gls <- gls(glucagonAUC ~ visit*group,
               correlation = corSymm(form=~as.numeric(visit)|id),
               weights = varIdent(form=~1|visit),
               data = gastricbypassL, na.action = na.omit)
logLik(eUN.gls)
logLik(eUN.lmm)
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}
'log Lik.' -295.31 (df=18)
[1] -295.31
\end{verbatim}


\clearpage
