inst/doc-equivalence/equivalence.tex
\subsection{lme4 package}
\label{sec:org97a6a6e}

The model class obtained with the \texttt{lmm} function overlaps the model
class of the \texttt{lmer} function from the lme4 package.
\begin{lstlisting}[language=r,numbers=none]
library(lme4)
library(lmerTest)
\end{lstlisting}

For instance, the compound symmetry is equivalent to a random
intercept model (when the within subject correlation is positive):
\begin{lstlisting}[language=r,numbers=none]
eRI.lmer <- lmer(weight ~ visit*group + (1|id),
                 data = gastricbypassL)
logLik(eRI.lmer)
logLik(eRI.lmm)
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}
'log Lik.' -236.21 (df=10)
[1] -236.21
\end{verbatim}


The estimated random effects match:
\begin{lstlisting}[language=r,numbers=none]
range(ranef(eRI.lmm)-ranef(eRI.lmer)$id)
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}
[1] -1.5513e-08  2.4171e-08
\end{verbatim}


Nested random effects correspond to block unstructured:
\begin{lstlisting}[language=r,numbers=none]
eNRI.lmm <- lmm(weight ~ visit*group, structure = RE(~(1|id/baseline)),
               data = gastricbypassL, repetition = ~visit|id)
eNRI.lmer <- lmer(weight ~ visit*group + (1|id/baseline),
                  data = gastricbypassL)
logLik(eNRI.lmer)
logLik(eNRI.lmm)
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}
'log Lik.' -234.97 (df=11)
[1] -234.97
\end{verbatim}


And the estimated random effects still match:
\begin{lstlisting}[language=r,numbers=none]
eRanefNRI.lmm <- ranef(eNRI.lmm, format = "wide")
eRanefNRI.lmer <- ranef(eNRI.lmer)
## id
range(eRanefNRI.lmm$estimate-eRanefNRI.lmer$id)
## baseline
range(c(eRanefNRI.lmm$estimate.FALSE,eRanefNRI.lmm$estimate.TRUE)-ranef(eNRI.lmer)$`baseline:id`)
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}
[1] -5.8317e-06  9.0913e-06
[1] -8.5850e-05  7.8971e-05
\end{verbatim}


\clearpage

An unstructure residual covariance matrix can also be obtained using
random slopes:
\begin{lstlisting}[language=r,numbers=none]
eUN.lmer <- lmer(glucagonAUC ~ visit*group + (0 + visit|id),
                 data = gastricbypassL,
                 control = lmerControl(check.nobs.vs.nRE = "ignore"))
logLik(eUN.lmer)
logLik(eUN.lmm)
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}
Warning message:
In checkConv(attr(opt, "derivs"), opt$par, ctrl = control$checkConv,  :
  Model failed to converge with max|grad| = 0.00203036 (tol = 0.002, component 1)
'log Lik.' -295.31 (df=19)
[1] -295.31
\end{verbatim}


The uncertainty is quantified in a slightly different way, e.g.:
\begin{lstlisting}[language=r,numbers=none]
anova(eUN.lmm)
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}
		Multivariate Wald test 

                  F-statistic       df p.value   
mean: visit             5.803 (3,16.9) 0.00647 **
    : group             3.926 (1,18.0) 0.06302  .
    : visit:group       2.762 (3,17.3) 0.07332  .
\end{verbatim}


is very similar but not identical to:
\begin{lstlisting}[language=r,numbers=none]
## only the last line is comparable
anova(eUN.lmer)
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}
Type III Analysis of Variance Table with Satterthwaite's method
            Sum Sq Mean Sq NumDF DenDF F value  Pr(>F)    
visit         1339     446     3  17.4   18.29 1.3e-05 ***
group            5       5     1  18.1    0.22   0.647    
visit:group    203      68     3  17.4    2.77   0.073 .  
---
Signif. codes:  0 ‘***’ 0.001 ‘**’ 0.01 ‘*’ 0.05 ‘.’ 0.1 ‘ ’ 1
\end{verbatim}


It is also possible to fit cross-random effects such as:
\begin{lstlisting}[language=r,numbers=none]
data("Penicillin")
eCRI.lmer <- lmer(diameter ~ 1 + (1|plate) + (1|sample), Penicillin)
logLik(eCRI.lmer)
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}
'log Lik.' -165.43 (df=4)
\end{verbatim}



using \texttt{lmm}:
\begin{lstlisting}[language=r,numbers=none]
Penicillin$index <- paste(Penicillin$sample,Penicillin$plate,sep=".")
Penicillin$id <- 1

eCRI.lmm <- lmm(diameter ~ 1 + (1|plate) + (1|sample), data = Penicillin)
logLik(eCRI.lmm)
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}
[1] -165.43
\end{verbatim}


Despite being significantly slower, the loglikelihood and random
effect still match:
\begin{lstlisting}[language=r,numbers=none]
range(ranef(eCRI.lmm)$estimate-rbind(ranef(eCRI.lmer)$plate,ranef(eCRI.lmer)$sample))
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}
[1] -4.3812e-07  6.0172e-07
\end{verbatim}
\subsection{mmrm package}
\label{sec:org138b936}

The package \texttt{mmrm} is an alternative implementation of mixed models
specified via covariance structures:
\begin{lstlisting}[language=r,numbers=none]
library(mmrm)
e.mmrm <- mmrm(
  formula = FEV1 ~ RACE + SEX + ARMCD * AVISIT + us(AVISIT | USUBJID),
  data = fev_data
)
\end{lstlisting}

It leads nearly identical results compared to \texttt{lmm}:
\begin{lstlisting}[language=r,numbers=none]
e.lmm <- lmm(
  formula = FEV1 ~ RACE + SEX + ARMCD * AVISIT,
  repetition = ~ AVISIT | USUBJID, structure = "UN",
  data = fev_data, type.information = "expected"
)
\end{lstlisting}
\phantomsection
\label{}
\begin{verbatim}
Warning message:
In .lmmNormalizeData(as.data.frame(data)[unique(stats::na.omit(var.all))],  :
    3 clusters have been removed.
\end{verbatim}


\begin{lstlisting}[language=r,numbers=none]
logLik(e.mmrm) - logLik(e.lmm)
range(coef(e.mmrm) - coef(e.lmm))
range(vcov(e.mmrm) - vcov(e.lmm))
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}
[1] -2.5413e-06
[1] -0.00018301  0.00016268
[1] -0.00039710  0.00020479
\end{verbatim}


The main differences are:
\begin{itemize}
\item \texttt{mmrm} uses the expected information matrix to quantify uncertainty
instead of the observed information matrix.
\item \texttt{mmrm} implements the Kenward and Roger method for computing the degrees of
freedom and not only the Satterthwaite approximation
\item \texttt{mmrm} implements different covariance patterns
\item \texttt{mmrm} is faster and probably more memorry efficient
\item \texttt{mmrm} has currently fewer post-processing methods (e.g. adjustment
multiple comparisons when testing several model parameters). This
being said, the latest version of the package (0.3.7) included
several additional extractor of model feature so this may be
improved in the future.
\end{itemize}
