inst/doc-equivalence/equivalence.tex
\subsection{emmeans package}
\label{sec:org40bd691}

To illustrate a key difference between the emmeans package and the
\texttt{effects.lmm} function we consider an informative and unbalanced group
variable:
\begin{lstlisting}[language=r,numbers=none]
gastricbypassLB$group2 <- gastricbypassLB$weight1>150
\end{lstlisting}

Since \texttt{lmm}:
\begin{lstlisting}[language=r,numbers=none]
eCS.lmm_2 <- lmm(glucagonAUC ~ visit*group2, repetition =~visit|id, structure = "CS", data = gastricbypassLB)
logLik(eCS.lmm_2)
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}
[1] -315.2
\end{verbatim}


we will use the equivalent with the random effect specification:

\begin{lstlisting}[language=r,numbers=none]
eRI.lmer_2 <- lmer(glucagonAUC ~ visit*group2 + (1|id), data = gastricbypassLB)
logLik(eRI.lmer_2)
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}
'log Lik.' -315.2 (df=10)
\end{verbatim}


While the two models are equivalent, the average outcome output by
\texttt{effects}:
\begin{lstlisting}[language=r,numbers=none]
effects(eCS.lmm_2, variable = NULL)
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}
		Average counterfactual outcome

      estimate    se   df  lower  upper
(t=1)   32.317 4.426 64.3 23.476 41.158
(t=2)   29.653 4.535 65.2 20.598 38.709
(t=3)   77.308 4.535 65.1  68.25 86.366
(t=4)    51.95 4.426 64.3 43.109 60.791
\end{verbatim}


substantially differ from the one of emmeans:
\begin{lstlisting}[language=r,numbers=none]
library(emmeans)
emmeans(eRI.lmer_2, specs=~visit)
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}
NOTE: Results may be misleading due to involvement in interactions
 visit emmean   SE   df lower.CL upper.CL
 1       33.6 5.53 64.2     22.6     44.7
 2       32.0 5.57 64.4     20.9     43.2
 3       70.0 5.57 64.4     58.9     81.1
 4       47.2 5.53 64.2     36.1     58.2

Results are averaged over the levels of: group2 
Degrees-of-freedom method: kenward-roger 
Confidence level used: 0.95
\end{verbatim}

This is because when averaging over the level of a covariate, emmeans
considers \emph{balanced groups}. In the example, the groups are not
balanced:
\begin{lstlisting}[language=r,numbers=none]
table(gastricbypassLB$group2)/NROW(gastricbypassLB)
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}

FALSE  TRUE 
  0.8   0.2
\end{verbatim}


Based on the group and timepoint specific means:
\begin{lstlisting}[language=r,numbers=none]
eCS.elmm_2 <- model.tables(effects(eCS.lmm_2, variable = "group2"))
eCS.elmm_2
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}
  group2 visit estimate     se     df  lower  upper    p.value
1  FALSE     1   31.430 4.9484 64.349 21.545 41.314 2.4688e-08
2  FALSE     2   28.067 5.0996 65.383 17.884 38.251 6.6737e-07
3  FALSE     3   82.173 5.1008 65.211 71.986 92.359 0.0000e+00
4  FALSE     4   55.126 4.9484 64.349 45.241 65.010 0.0000e+00
5   TRUE     1   35.864 9.8967 64.349 16.095 55.633 5.7374e-04
6   TRUE     2   35.997 9.8967 64.349 16.228 55.766 5.4953e-04
7   TRUE     3   57.848 9.8967 64.349 38.079 77.617 1.8339e-07
8   TRUE     4   39.246 9.8967 64.349 19.477 59.015 1.8651e-04
\end{verbatim}


We illustrate the difference:
\begin{itemize}
\item emmeans:
\end{itemize}
\begin{lstlisting}[language=r,numbers=none]
0.5*eCS.elmm_2[eCS.elmm_2$group2==FALSE,"estimate"]+0.5*eCS.elmm_2[eCS.elmm_2$group2==TRUE,"estimate"]
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}
[1] 33.647 32.032 70.010 47.186
\end{verbatim}


\begin{itemize}
\item effects:
\end{itemize}
\begin{lstlisting}[language=r,numbers=none]
0.8*eCS.elmm_2[eCS.elmm_2$group2==FALSE,"estimate"]+0.2*eCS.elmm_2[eCS.elmm_2$group2==TRUE,"estimate"]
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}
[1] 32.317 29.653 77.308 51.950
\end{verbatim}


The "emmeans" approach gives equal "weight" to the expected value of
both group:
\begin{lstlisting}[language=r,numbers=none]
mu.group1 <-  as.double(coef(e.group)["(Intercept)"])
mu.group2 <-  as.double(coef(e.group)["(Intercept)"] + coef(e.group)["group2TRUE"])
p.group1 <- 14/20          ; p.group2 <- 6/20
c(emmeans = (mu.group1+mu.group2)/2, predict = mu.group1 * p.group1 + mu.group2 * p.group2)
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}
 emmeans  predict 
4.450435 4.514352
\end{verbatim}


\clearpage
\subsection{effectsize package (\(R^2\) or \(\eta^2\))}
\label{sec:org99dcd39}

Partial \(\eta^2\) can be computed based on \texttt{lmer} using the effectsize package:
\begin{lstlisting}[language=r,numbers=none]
library(effectsize)
eta_squared(eCS.lmer)
cat("\n")
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}
# Effect Size for ANOVA (Type III)

Parameter   | Eta2 (partial) |       95% CI
-------------------------------------------
visit       |           0.64 | [0.50, 1.00]
group       |           0.01 | [0.00, 1.00]
visit:group |           0.19 | [0.03, 1.00]

- One-sided CIs: upper bound fixed at
\end{verbatim}


and are approximately equal to what one can compute "manually":
\begin{lstlisting}[language=r,numbers=none]
eCS.Wald <- anova(eCS.lmm)$multivariate
eCS.Wald$df.num*eCS.Wald$statistic/(eCS.Wald$df.num*eCS.Wald$statistic+eCS.Wald$df.denom)
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}
[1] 0.335374 0.033811 0.186290
\end{verbatim}


The will not be true for heteroschedastic models:
\begin{lstlisting}[language=r,numbers=none]
eUN.Wald <- anova(eUN.lmm)$multivariate
eUN.Wald$df.num*eUN.Wald$statistic/(eUN.Wald$df.num*eUN.Wald$statistic+eUN.Wald$df.denom)
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}
[1] 0.50787 0.17905 0.32380
\end{verbatim}


compared to:
\begin{lstlisting}[language=r,numbers=none]
eta_squared(eUN.lmer)
cat("\n")
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}
# Effect Size for ANOVA (Type III)

Parameter   | Eta2 (partial) |       95% CI
-------------------------------------------
visit       |           0.76 | [0.54, 1.00]
group       |           0.01 | [0.00, 1.00]
visit:group |           0.32 | [0.00, 1.00]

- One-sided CIs: upper bound fixed at
\end{verbatim}


But in that case both may be misleading as the proportion of explained
variance is not clearly defined.
\subsection{MuMIn package (\(R^2\))}
\label{sec:org81072cc}

\begin{lstlisting}[language=r,numbers=none]
library(MuMIn)
r.squaredGLMM(eCS.lmer)
cat("\n")
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}
         R2m     R2c
[1,] 0.51728 0.62222
\end{verbatim}


To reproduce these R2, we extract from the random intercept model:
\begin{itemize}
\item the residual variance
\end{itemize}
\begin{lstlisting}[language=r,numbers=none]
sigmaW <- sigma(eCS.lmm)[1,1]-sigma(eCS.lmm)[1,2]
\end{lstlisting}

\begin{itemize}
\item the variance of the random effect
\end{itemize}
\begin{lstlisting}[language=r,numbers=none]
sigmaB <- sigma(eCS.lmm)[1,2]
\end{lstlisting}

\begin{itemize}
\item the variance of the fitted values:
\end{itemize}
\begin{lstlisting}[language=r,numbers=none]
sigma2_XB <- var(fitted(eCS.lmm))
\end{lstlisting}

and evalutae the ratios:
\begin{lstlisting}[language=r,numbers=none]
c(R2m = sigma2_XB/(sigmaW + sigmaB + sigma2_XB),
  R2c = (sigma2_XB + sigmaB)/(sigmaW + sigmaB + sigma2_XB))
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}
    R2m     R2c 
0.52549 0.62865
\end{verbatim}
